let questions = [
  "Буває, що я серджуся",
  "Зазвичай вранці я прокидаюся свіжим і відпочивши",
  "Зараз я приблизно так само працездатний, як і завжди",
  "Доля безумовно несправедлива до мене",
  "Запори у мене бувають дуже рідко",
  "Часом мені дуже хотілося лишити свій дім",
  "Часом у мене бувають напади сміху або плачу, з якими я ніяк не можу справитися",
  "Мені здається, що мене ніхто не розуміє",
  "Вважаю, що якщо хтось заподіяв мені зло, я повинен йому відповісти тим же",
  "Іноді мені в голову приходять такі нехороші думки, що краще про них нікому не розповідати",
  "Мені важко зосередитися на якому-небудь завданні або роботі",
  "У мене бувають дуже дивні і незвичайні переживання",
  "У мене були відсутні неприємності через мою поведінку",
  "В дитинстві я у свій час скоював дрібні крадіжки",
  "Буває, у мене з’являється бажання ламати або крушити все навколо",
  "Бувало, що я цілими днями або навіть тижнями нічого не міг робити, тому що ніяк не міг примусити себе взятися до роботи",
  "Сон у мене переривчастий і неспокійний",
  "Моя сім'я не схвалює ту роботи, яку я обрав",
  "Бували випадки, що я не виконував своїх обіцянок",
  "Голова у мене болить часто",
  "Раз на тиждень або частіше я без жодної очевидної причини раптово відчуваю жар у всьому тілі",
  "Було б добре, якби майже всі закони відмінили",
  "Стан мого здоров’я майже такий же, як у більшості моїх знайомих (не гірше)",
  "Зустрічаючи на вулиці своїх знайомих або шкільних друзів, з якими я давно не бачився, я вважаю за краще проходити мимо, якщо вони зі мною не заговорюють першими",
  "Більшості людей, які мене знають, я подобаюся",
  "Я людина товариська",
  "Іноді я так наполягаю на своєму, що люди втрачають терпіння",
  "Значну частину часу настрій у мене пригнічений",
  "Тепер мені важко сподіватися на те, що я чого-небудь досягну у житті",
  "У мене мало впевненості в собі",
  "Іноді я кажу неправду",
  "Зазвичай я вважаю, що життя – гарна річ",
  "Я вважаю, що більшість людей здатна збрехати, щоб просунутися по службі",
  "Я охоче беру участь у зібраннях, зборах і інших суспільних заходах",
  "Я сварюся з членами моєї сім’ї дуже рідко",
  "Іноді у мене виникає сильне бажання порушити правила пристойності або кому-небудь нашкодити",
  "Найважча боротьба для мене - це боротьба з самим собою",
  "М’язові судоми або сіпання у мене бувають украй рідко (або майже не бувають)",
  "Я досить байдужий до того, що зі мною буде",
  "Іноді, коли я недобре почуваюсь, буваю дратівливим",
  "Значну частину часу у мене таке відчуття, що я зробив щось не те або навіть щось погане",
  "Деякі люди до того полюбляють командувати, що мені так і кортить робити все наперекір, навіть якщо я знаю, що вони мають рацію",
  "Я часто вважаю себе зобов'язаним відстоювати те, що вважаю справедливим",
  "Моя мова зараз така ж як завжди (ні швидше і ні повільніше, немає ні хрипоти, ні невиразності)",
  "Я вважаю, що моє сімейне життя таке ж добре, як у більшості моїх знайомих",
  "Мене вкрай зачіпає, коли мене критикують або сварять",
  "Іноді у мене буває таке відчуття, що я просто повинен нанести ушкодження собі або кому-небудь іншому",
  "Моя поведінка значною мірою визначається звичаями тих, хто мене оточує",
  "В дитинстві у мене була така компанія, де всі прагнули стояти один за одного",
  "Іноді мені так і кортить з ким-небудь затіяти бійку",
  "Бувало, що я казав про речі, в яких не розуміюсь",
  "Зазвичай я засинаю спокійно і мене не турбують ніякі думки",
  "Останні декілька років я відчуваю себе добре",
  "У мене ніколи не було ні припадків, ні судом",
  "Зараз моя вага постійна (я не худну і не повнішаю)",
  "Я вважаю, що мене часто карали несправедливо",
  "Я легко плачу",
  "Я мало втомлююся",
  "Я був би досить спокійний, якби у кого-небудь з моєї сім'ї були неприємності через порушення закону",
  "З моїм розумом коїться щось недобре",
  "Щоб приховати свою сором'язливість, мені доводиться докладати великих зусиль.",
  "Напади запаморочення у мене бувають дуже рідко (або майже не бувають)",
  "Мене турбують сексуальні (статеві) питання",
  "Мені важко підтримувати розмову з людьми, з якими я тільки що познайомився",
  "Коли я намагаюся щось зробити, то часто помічаю, що у мене тремтять руки",
  "Руки у мене такі ж спритні і моторні, як і раніше",
  "Велику частину часу я відчуваю загальну слабкість",
  "Іноді, коли я збентежений я сильно пітнію і мене це дратує",
  "Буває, що я відкладаю на завтра те, що повинен зробити сьогодні",
  "Думаю, що я людина приречена",
  "Бували випадки, що мені було важко утриматися від того, щоб що-небудь не поцупити в кого-небудь або де-небудь, наприклад у магазині",
  "Я зловживав спиртними напоями",
  "Я часто про що-небудь турбуюся",
  "Мені б хотілося бути членом декількох кружків або зборів",
  "Я рідко задихаюся, і у мене не буває сильного серцебиття",
  "Все своє життя я суворо дотримуюсь принципів, заснованих на почутті обов’язку",
  "Траплялося, що я перешкоджав або вчиняв наперекір людям просто із принципу, а не тому, що справа була дійсно важливою",
  "Якщо мені не погрожує штраф і машин поблизу немає, я можу перейти вулицю там, де бажаю, а не там де потрібно",
  "Я завжди був незалежним і вільним від контролю з боку сім'ї",
  "У мене бували періоди такої сильної стурбованості, що я навіть не міг всидіти на місці",
  "Часто мої вчинки тлумачилися не вірно",
  "Мої батьки і (або) інші члени моєї сім’ї прискіпуються до мене більше, ніж треба",
  "Хтось керує моїми думками",
  "Люди байдужі до того, що з тобою трапиться",
  "Мені подобається бути в компанії, де всі жартують один над одним",
  "В школі я засвоював матеріал повільніше, аніж інші",
  "Я цілком впевнений у собі",
  "Нікому не довіряти – найбезпечніше",
  "Раз на тиждень або частіше я буваю дуже збудженим і схвильованим",
  "Коли я знаходжуся в компанії, мені важко знайти відповідну тему для розмови",
  "Мені легко примусити інших людей боятися мене, інколи, я роблю це ради забави",
  "У грі я вважаю за краще вигравати",
  "Безглуздо засуджувати людину, яка обдурила того, хто сам дозволяє себе обдурювати",
  "Хтось намагається впливати на мої думки",
  "Я щодня випиваю багато води",
  "Щасливішим за все я буваю наодинці",
  "Я обурююся кожного разу, коли дізнаюся, що злочинець з якої-небудь причини залишився безкарним",
  "У моєму житті був один або декілька випадків, коли я відчував, що хтось за допомогою гіпнозу примушує мене скоювати ті або інші вчинки",
  "Я дуже рідко заговорюю з людьми першим",
  "Мені приємно мати серед своїх знайомих значних людей, це як би додає мені вагу у власних очах",
  "Іноді без жодної причини у мене раптом наступають періоди незвичайної веселості",
  "У мене ніколи не було зіткнень із законом",
  "Життя для мене майже завжди пов'язано з напругою",
  "У школі мені було дуже важко виступати перед класом",
  "Люди проявляють по відношенню до мене стільки співчуття і симпатії, наскільки я заслуговую",
  "Я відмовляюся грати в деякі ігри, тому що це у мене погано виходить",
  "Мені здається, що я знаходжу друзів з такою ж легкістю, як і інші",
  "Мені неприємно, коли навколо мене є люди",
  "Як правило, мені не везе",
  "Мене легко збити з пантелику",
  "Деякі з членів моєї сім'ї скоювали вчинки, які мене лякали",
  "Іноді у мене бувають напади сміху або плачу, з якими я ніяк не можу впоратися",
  "Мені важко приступити до виконання нового завдання або розпочати нову справу",
  "Якби люди не були налаштовані проти мене, я досягнув би у житті набагато більшого",
  "Мені здається, що мене ніхто не розуміє",
  "Серед моїх знайомих є люди, які мені не подобаються",
  "Я легко втрачаю терпіння до людей",
  "Часто у новій обстановці я переживаю почуття тривоги",
  "Часто мені хочеться померти",
  "Іноді я такий збуджений, що мені важко заснути",
  "Часто я переходжу на іншу сторону вулиці, щоб уникнути зустрічі з тим, кого я побачив",
  "Бувало, що я кидав почату справу, оскільки боявся, що я не справлюся з нею",
  "Майже щодня трапляється що-небудь, що лякає мене",
  "Навіть серед людей я зазвичай відчуваю себе самотнім",
  "Я переконаний, що існує лише одне єдине правильне розуміння значення життя",
  "В гостях я частіше сиджу де-небудь осторонь або розмовляю з ким-небудь одним, ніж беру участь у загальних розвагах",
  "Мені часто кажуть, що я запальний",
  "Буває, що я з ким-небудь пліткую",
  "Часто мені неприємно, коли я намагаюся застерегти кого-небудь від помилок, а мене розуміють неправильно",
  "Я часто звертаюся до людей за порадою",
  "Часто, навіть тоді, коли усе для мене складається добре, я відчуваю що мені усе байдуже",
  "Мене досить важко вивести з себе",
  "Коли я намагаюся вказати людям на їх помилки або допомогти вони часто розуміють мене неправильно",
  "Зазвичай я спокійний, і мене нелегко вивести із стану душевної рівноваги",
  "Я заслуговую суворого покарання за свою провину",
  "Мені притаманно так сильно переживати за свої розчарування, що я не можу примусити себе не думати про них",
  "Часом мені здається, що я ні на що не здатний",
  "Бувало, що під час обговорення деяких питань я, особливо не замислюючись, погоджувався з думкою інших",
  "Мене дуже турбують різного роду нещастя",
  "Мої переконання і погляди непохитні",
  "Я вважаю, що можна не порушуючи закон спробувати знайти в ньому лазівку",
  "Є люди, які мені настільки неприємні, що я в глибині душі радію, коли вони одержують прочухан за що-небудь",
  "У мене бували періоди, коли через хвилювання я втрачав сон",
  "Я відвідую різні суспільні заходи, тому що це дозволяє бувати мені серед людей",
  "Можна пробачити людям порушення тих правил, які вони вважають нерозсудливими",
  "У мене є погані звички, які є настільки сильними, що боротися з ними просто марно",
  "Я охоче знайомлюся з новими людьми",
  "Буває, що непристойний жарт у мене викликає сміх",
  "Якщо справа йде у мене погано, то мені відразу хочеться все кинути",
  "Я вважаю за краще діяти відповідно до власних планів, а не слідувати вказівкам інших",
  "Мені подобається, коли оточуючі знають мою точку зору.",
  "Якщо я поганої думки про людину або навіть зневажаю її, я мало прагну приховати це від неї",
  "Я людина нервова і легко збудлива",
  "Все у мене виходить погано, не так як треба",
  "Майбутнє здається мені безнадійним",
  "Люди досить легко можуть змінити мою думку, навіть якщо до цього вона здавалася мені остаточною",
  "Кілька разів на тиждень у мене буває таке відчуття, що повинно трапитися щось жахливе",
  "Значну частину часу я відчуваю себе втомленим",
  "Я люблю бувати на вечірках і просто в компаніях",
  "Я прагну відхилитися від конфліктів і скрутних положень",
  "Мене дуже дратує те, що я забуваю, куди кладу речі",
  "Пригодницькі розповіді мені подобаються більше, ніж розповіді про любов",
  "Якщо я хочу зробити щось, але оточуючі вважають, що цього робити не варто, я можу легко відмовитися від своїх намірів",
  "Безглуздо засуджувати людей, які прагнуть урвати від життя все, що можуть",
  "Мені байдуже, що про мене думають інші",
  "Я абсолютно не пристосований до військової служби і це мене дуже лякає",
  "Я переконаний, що чоловіки повинні служити у Збройних Силах тільки за власним бажанням",
  "Останнім часом у мене все частіше і частіше трапляються «промахи» і невдачі по службі.",
  "Найбільші труднощі для мене під час служби – це необхідність підкорятися командирам і начальникам",
  "Тим правилами, які, на мій погляд, несправедливі, я завжди прагну протидіяти",
  "Мені хотілося б випробувати себе серйозною і небезпечною справою",
  "Мене довго не залишає відчуття образи, заподіяне товаришами",
  "Жити за військовим розпорядком для мене просто нестерпне",
  "Я сумніваюся, чи зможу я зі своїм здоров'ям витримати всі навантаження військової служби",
  "Я заздрю тим, хто зміг ухилитися від військової служби",
  "Я відчуваю все більше і більше розчарувань по відношенню до моєї військової спеціальності",
  "Я часто розгублююся у складних і небезпечних ситуаціях",
  "Мені хотілося б служити у ПДВ або частинах спецназу",
  "Із службою у мене ніщо не виходить (не «клеїться»). Часто думаю: «не моя це справа»",
  "Коли мною хтось командує, це викликає у мене відчуття протесту",
  "Мені завжди було важко пристосовуватися до нового колективу",
  "Під час подальшої служби я був би не проти послужити там, де небезпечно і де ведуться бойові дії ",
  "Присяга на вірність Вітчизні у сучасних умовах втратила свою актуальність",
  "Мені завжди було нелегко пристосовуватися до нових умов життя",
  "У складних ситуаціях я не можу швидко приймати правильні рішення",
  "Я упевнений, що в майбутньому не стану укладати або продовжувати контракт на продовження військової служби",
  "У мене бувають періоди похмурої дратівливості, під час яких я «зриваю зло» на оточуючих",
  "Я насилу витримую фізичні навантаження, пов’язані з моєю професійною діяльністю",
  "Я достатньо спокійно ставлюсь до необхідності брати участь в тривалих і небезпечних відрядженнях",
  "Навряд чи я буду мати бажання присвятити все своє життя військовій професії (залишитися на службу за контрактом, поступити у військове училище)",
  "«За компанію» з товаришами я можу прийняти неабияку кількість алкоголю (перевищити свою звичайну «норму»)",
  "У компаніях, де я часто буваю, друзі іноді палять «травичку». Я їх за це не засуджую",
  "Останнім часом, щоб не «зірватися», я був вимушений приймати заспокійливі ліки",
  "Мої батьки (родичі) часто виказували побоювання у зв'язку з моїми випивками",
  "Немає нічого поганого, коли люди намагаються випробувати на собі незвичайні стани, приймаючи деякі речовини",
  "У стані агресії я здатний багато на що",
  "Я крутий і жорстокий з оточуючими",
  "Якщо хтось заподіяв мені зло, я вважаю зобов'язаним відплатити йому тим же («око за око, зуб за зуб»)",
  "Можна погодитися з тим, що я не дуже-то схильний виконувати багато наказів, вважаючи їх безрозсудними",
  "Я думаю, що будь-яке положення законів і військових статутів можна тлумачити двояко",
]; //200 питань;
let keys_dost_false = [1, 10, 19, 31, 51, 69, 78, 92, 101, 116, 128, 138, 148]; // ключі на достовірність, якщо 10 і більше є "НІ", то результати недостовірні (13)
let keys_pr_true = [
  4, 6, 7, 8, 11, 12, 15, 16, 17, 18, 20, 21, 28, 29, 30, 36, 37, 39, 40, 41,
  47, 57, 60, 63, 65, 67, 68, 70, 73, 80, 82, 83, 84, 86, 89, 94, 95, 96, 98,
  102, 103, 108, 109, 110, 111, 112, 113, 115, 117, 118, 119, 120, 122, 123,
  124, 125, 127, 129, 131, 135, 136, 137, 139, 143, 146, 149, 153, 154, 155,
  156, 157, 158, 161, 162]; //(74);
let keys_pr_false = [
  2, 3, 5, 23, 25, 32, 38, 44, 45, 52, 53, 54, 55, 58, 62, 66, 75, 87, 105, 132,
  134, 140]; //(22);
let keys_kp_true = [
  9, 24, 27, 43, 46, 61, 64, 81, 88, 90, 99, 104, 106, 114, 121, 126, 133, 142,
  151, 152]; //(20);
let keys_kp_false = [26, 34, 35, 48, 49, 74, 85, 107, 130, 144, 147, 159]; //(12);
let keys_mn_true = [
  14, 22, 33, 42, 50, 56, 59, 71, 72, 77, 79, 91, 93, 141, 145, 150, 164, 165]; //(18);
let keys_mn_false = [13, 76, 97, 100, 160, 163]; //(6);
let keys_vps_true = [
  166, 167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 179, 180, 181, 183,
  184, 185, 186, 187, 188, 190]; //(21);
let keys_vps_false = [171, 178, 182, 189]; //(4);
let keys_dap_true = [
  6, 9, 14, 15, 22, 36, 39, 42, 47, 50, 56, 59, 71, 72, 91, 93, 117, 127, 141,
  145, 151, 152, 164, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200
]; //(33);
let keys_dap_false = [13, 100, 163]; //(3);
let keys_sr_true = [
  4, 8, 10, 28, 29, 39, 41, 47, 70, 84, 115, 119, 124, 136, 137, 149, 154, 155]; //(18);
let keys_sr_false = [32, 105]; //(2);

// Зберігання результатів опитування
let surveyResults = [];
function cssBlocks() {
  document.getElementById("instruction").style.display = "none";
  document.getElementById("survey-container").style.display = "block";
}
function stopAnswers() {
  let exit = confirm("Ви дійсно хочете припинити тестування?");
  if (exit) {
    this.close();
  }
}
// Функція для відображення питань
function showQuestion(index) {
  let surveyContainer = document.getElementById("survey-container");
  surveyContainer.innerHTML = `<p>${index + 1}. ${questions[index]}</p>
                                <label><input type="radio" name="answer" value=true><b> Так</b></label>
                                <label><input type="radio" name="answer" value=false><b> Ні</b></label>
                               <p><button id="next" onclick="submitAnswer(${index})">Далі</button></p>`;
}
// Функція для обробки відповіді і переходу до наступного питання
function submitAnswer(index) {
  let selectedAnswer = document.querySelector('input[name="answer"]:checked');

  if (selectedAnswer) {
    surveyResults.push(selectedAnswer.value);
    if (index < questions.length - 1) {
      showQuestion(index + 1);
    } else {
      displayResults();
    }
  } else {
    alert("Будь ласка, оберіть відповідь");
  }
}
function proveResults(arr, bool) {
  let num = 0;
  let surveyResult_mod = surveyResults.map(function (element) {
    return element === "true";
  });

  for (i = 0; i < arr.length; i++) {
    if (surveyResult_mod[arr[i] - 1] === bool) {
      num++;
    }
  }
  return num;
}
// -----------------Зміна на знаки -------------------//
function boolTosign() {
  for (var i = 0; i < surveyResults.length; i++) {
    if (surveyResults[i] === "true") {
      surveyResults[i] = "+";
    } else if (surveyResults[i] === "false") {
      surveyResults[i] = "–";
    }
  }
}
//----------- Таблиця відображення тесту -------------//
function tableTest() {
  // Отримуємо таблицю за її ідентифікатором
  //var header = document.header.getElementById("header");
  var table = document.getElementById("results");

  // Розділяємо масив на рядки та стовпці (10 на 20)
  var rows = 20;
  var columns = 10;

  // Індекс для ітерації по масиву
  var index = 0;

  // Заповнюємо таблицю значеннями з масиву
  for (var i = 0; i < rows; i++) {
    var row = table.insertRow(i);

    for (var j = 0; j < columns; j++) {
      var cell = row.insertCell(j);
      boolTosign();
      cell.innerHTML += `<span>${index + 1}&nbsp;</span><span>${
        surveyResults[index]
      }</span>`;
      index++;
    }
  }
}

// Функція для відображення результатів
function displayResults() {
  // document.getElementById("header").style.display="block";
  let surveyContainer = document.getElementById("survey-container");
  let dost = proveResults(keys_dost_false, false);
  let res_dost_text = String();
  if (dost >= 10) {
    document.getElementById("content").style.display = "none";
    res_dost_text = confirm(
      "Отримані результати слід вважати необ'єктивними, тому треба пройти тест знову. Чи бажаєте Ви це зробити?"
    );
    if (res_dost_text) {
      window.location.reload();
    } else {
      this.close();
    }
  } else if (dost <= 9 && dost >= 6) {
    res_dost_text =
      "ДОСТАТНЯ достовірність результатів обстеження. Окремі ознаки соціальної бажаності.";
  } else {
    res_dost_text = "ВИСОКА достовірність результатів обстеження.";
  }
  let pr_plus = proveResults(keys_pr_true, true);
  let pr_minus = proveResults(keys_pr_false, false);
  let pr = pr_plus + pr_minus;
  console.log(pr);
  let kp_plus = proveResults(keys_kp_true, true);
  let kp_minus = proveResults(keys_kp_false, false);
  let kp = kp_plus + kp_minus;
  console.log(kp);
  let mn_plus = proveResults(keys_mn_true, true);
  let mn_minus = proveResults(keys_mn_false, false);
  let mn = mn_plus + mn_minus;
  console.log(mn);
  //-----------Особистісно адаптаційний потенціал (ОАП)----------//
  let oap = pr + kp + mn;
  console.log(oap);
  let oap_sten = Number();
  let res_oap = [];
  let res_oap_text = String();
  if (oap >= 87) {
    oap_sten = 1;
  } else if (oap <= 86 && oap >= 75) {
    oap_sten = 2;
  } else if (oap <= 74 && oap >= 63) {
    oap_sten = 3;
  } else if (oap <= 62 && oap >= 51) {
    oap_sten = 4;
  } else if (oap <= 50 && oap >= 40) {
    oap_sten = 5;
  } else if (oap <= 39 && oap >= 31) {
    oap_sten = 6;
  } else if (oap <= 30 && oap >= 25) {
    oap_sten = 7;
  } else if (oap <= 24 && oap >= 21) {
    oap_sten = 8;
  } else if (oap <= 20 && oap >= 18) {oap_sten = 9;}
  else {
    oap_sten = 10;
  }
  if (oap_sten == 1 || oap_sten == 2) {
    res_oap = [4, "НЕДОСТАТНІЙ", "Не"];
  } else if (oap_sten == 3 || oap_sten == 4) {
    res_oap = [3, "ЗАДОВІЛЬНИЙ", "Мінімально"];
  } else if (oap_sten <= 7 && oap_sten >= 5) {
    res_oap = [2, "ДОСТАТНІЙ", "В основному"];
  } else {
    res_oap = [1, "ВИСОКИЙ", "Повністю"];
  }
  res_oap_text = `${res_oap[1]} рівень розвитку адаптаційних можливостей особистості. ${res_oap[2]} відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності. ${res_oap[0]}-й рівень стійкості до бойового стресу.`;
  //----------------- Поведінкова регуляція (ПР) ------------------//
  let res_pr_text = String();
  let pr_sten = Number();
  if (pr >= 57) {
    pr_sten = 1;
  } else if (pr <= 56 && pr >= 46) {
    pr_sten = 2;
  } else if (pr <= 45 && pr >= 35) {
    pr_sten = 3;
  } else if (pr <= 34 && pr >= 27) {
    pr_sten = 4;
  } else if (pr <= 26 && pr >= 19) {
    pr_sten = 5;
  } else if (pr <= 18 && pr >= 13) {
    pr_sten = 6;
  } else if (pr <= 12 && pr >= 9) {
    pr_sten = 7;
  } else if (pr <= 8 && pr >= 6) {
    pr_sten = 8;
  } else if ((pr = 5)) {
    pr_sten = 9;
  } else {
    pr_sten = 10;
  }

  if (pr_sten >= 8) {
    res_pr_text =
      "ВИСОКИЙ рівень нервово-психічної стійкості і поведінкової регуляції. Високий рівень працездатності, у тому числі і в умовах вираженого стресу. Висока толерантність до несприятливих психічних і фізичних навантажень.";
  } else if (pr_sten == 7) {
    res_pr_text =
      "ДОСТАТНЬО ВИСОКИЙ рівень нервово-психічної стійкості і поведінкової регуляції. Достатньо високий рівень працездатності, у тому числі і в ускладнених умовах діяльності. Достатньо висока толерантність до психічних і фізичних навантажень. Достатньо висока стійкість до дії стрес-чинників.";
  } else if (pr_sten == 6) {
    res_pr_text =
      "ДОСТАТНІЙ рівень нервово-психічної стійкості і поведінкової регуляції. Достатній рівень працездатності, у тому числі і в ускладнених умовах діяльності. Достатня толерантність до психічних і фізичних навантажень. Достатня стійкість до дії стрес-чинників.";
  } else if (pr_sten == 5) {
    res_pr_text =
      "В ЦІЛОМУ ДОСТАТНІЙ рівень нервово-психічної стійкості і поведінкової регуляції. Стійкий рівень працездатності у звичних умовах життєдіяльності. При тривалій дії явних психічних навантажень можливо тимчасове погіршення якості діяльності.";
  } else if (pr_sten == 4) {
    res_pr_text =
      "ДЕЩО ПОНИЖЕНИЙ рівень нервово-психічної стійкості і поведінкової регуляції. Нестабільний рівень працездатності, що особливо проявляється в ускладнених умовах діяльності. Адаптація до нових і незвичайних умов життєдіяльності ускладнена і може супроводжуватися тимчасовим погіршенням функціонального стану організму.";
  } else if (pr_sten == 3) {
    res_pr_text =
      "ОКРЕМІ ознаки нервово-психічної нестійкості і порушення поведінкової регуляції. Недостатня толерантність до психічних і фізичних навантажень. Адаптація до нових умов життєдіяльності, як правило, ускладнена і може супроводжуватися тривалим погіршенням функціонального стану організму і професійної працездатності. При надзвичайно високих психічних навантаженнях можливий зрив професійної діяльності.";
  } else if (pr_sten == 2) {
    res_pr_text =
      "ВИРАЖЕНІ ознаки нервово-психічної нестійкості і порушення поведінкової регуляції. Низька толерантність до психічних і фізичних навантажень. Адаптація до нових умов життєдіяльності протікає хворобливо. Можливе тривале і виражене погіршення функціонального стану організму. Рівень професійної працездатності у даний період часу низький. При посиленні психічних навантажень достатньо вірогідний зрив професійної діяльності.";
  } else {
    res_pr_text =
      "Вкрай ВИСОКИЙ рівень нервово-психічної нестійкості. Ознаки граничних нервово-психічних розладів. Вкрай низька толерантність до психічних і фізичних навантажень. Адаптація до нових умов життєдіяльності протікає дуже хворобливо з тривалим і вираженим погіршенням функціонального стану організму. Працездатність у даний період часу різко знижена. Посилення психічних навантажень приводить до зриву професійної діяльності.";
  }

  //------------ Комунікативний потенціал (КП) --------------------//
  let res_kp_text = String();
  let kp_sten = Number();
  if (kp >= 23) {
    kp_sten = 1;
  } else if (kp <= 22 && kp >= 20) {
    kp_sten = 2;
  } else if (kp == 19 || kp == 18) {
    kp_sten = 3;
  } else if (kp <= 17 && kp >= 15) {
    kp_sten = 4;
  } else if (kp == 14 || kp == 13) {
    kp_sten = 5;
  } else if (kp == 12 || kp == 11) {
    kp_sten = 6;
  } else if (kp == 10 || kp == 9) {
    kp_sten = 7;
  } else if (kp == 8 || kp == 7) {
    kp_sten = 8;
  } else if (kp == 6) {
    kp_sten = 9;
  } else {
    kp_sten = 10;
  }
  if (kp_sten >= 8) {
    res_kp_text =
      "ВИСОКИЙ рівень комунікативних здібностей. Швидко адаптується у новому колективі. Легко встановлює контакти з оточуючими.У міжособистісному спілкуванні неконфліктний. Завжди адекватно оцінює свою роль і правильно будує міжперсональні взаємостосунки у колективі.";
  } else if (kp_sten == 7) {
    res_kp_text =
      "ДОСТАТНЬО ВИСОКИЙ рівень комунікативних здібностей. Достатньо швидко адаптується у новому колективі. При встановленні міжособистісних контактів з оточуючими, як правило, не зазнає труднощів. У спілкуванні не конфліктний. У більшості випадків адекватно оцінює свою роль в колективі. На критику реагує адекватно. Достатня здатність до корекції поведінки.";
  } else if (kp_sten == 6) {
    res_kp_text =
      "ДОСТАТНІЙ рівень комунікативних здібностей. Достатньо швидко адаптується у новому колективі. При встановленні міжособистісних контактів з оточуючими, як правило, не зазнає труднощів. У спілкуванні не конфліктний. У більшості випадків адекватно оцінює свою роль в колективі. На критику реагує адекватно. Достатня здатність до корекції поведінки.";
  } else if (kp_sten == 5) {
    res_kp_text =
      "Рівень комунікативних здібностей СЕРЕДНІЙ. У цілому без особливих ускладнень адаптується до нового колективу. При встановленні міжособистісних контактів з оточуючими іноді може неправильно будувати стратегію своєї поведінки. Разом з тим, до критичних зауважень відноситься адекватно, здатний коригувати свою поведінку. У спілкуванні не конфліктний. Достатньо адекватно оцінює свою роль у колективі.";
  } else if (kp_sten == 4) {
    res_kp_text =
      "ЗАДОВІЛЬНИЙ рівень комунікативних здібностей. На початковому етапі адаптації до нового колективу можуть виникати ускладнення. Не завжди правильно будує міжперсональні взаємостосунки, зважаючи на деяку неадекватність самооцінки. На критичні зауваження на свою адресу в основному реагує адекватно, хоча і дещо хворобливо. В цілому здатний до корекції своєї поведінки.";
  } else if (kp_sten == 3) {
    res_kp_text =
      "ПОНИЖЕНИЙ рівень комунікативних здібностей. Наявність окремих ознак акцентуації характеру. На початковому етапі адаптації до нового колективу виникають значні ускладнення. Міжперсональні взаємостосунки (як по горизонталі, так і по вертикалі) часто будує неправильно. Хворобливо реагує на критику. Недостатньо розвинута здатність до корекції своєї поведінки.";
  } else if (kp_sten == 2) {
    res_kp_text =
      "Рівень комунікативних здібностей НИЗЬКИЙ. Наявність ознак акцентуації характеру. Початковий етап адаптації до нового колективу розтягнутий у часі і, як правило, протікає вельми хворобливо. Часто виникають ускладнення в побудові міжособистісних контактів з оточуючими, зважаючи на наявність неадекватної самооцінки. Схильність до підвищеної конфліктності. Хворобливо реагує на критику. Фіксований на образах, що заподіяні йому оточуючими. Недостатньо розвинута здатність до корекції поведінки.";
  } else {
    res_kp_text =
      "ВКРАЙ НИЗЬКИЙ рівень комунікативних здібностей. Наявність виражених ознак акцентуації характеру. Адаптація до нового колективу протікає тривало і украй хворобливо. Постійно випробовує утруднення в побудові міжособистісних контактів з оточуючими. Високий рівень конфліктності. Колективом, як правило, відкидаємо. Фіксований на образах, заподіяних оточуючими, унаслідок чого схилений до ірраціональних вчинків. Вкрай низька здатність до корекції поведінки.";
  }

  //------------ Моральна нормативність (МН) --------------------//
  let res_mn_text = String();
  let mn_sten = Number();
  if (mn >= 17) {
    mn_sten = 1;
  } else if (mn == 16) {
    mn_sten = 2;
  } else if (mn == 15 || mn == 14) {
    mn_sten = 3;
  } else if (mn == 13 || mn == 12) {
    mn_sten = 4;
  } else if (mn == 11 || mn == 10) {
    mn_sten = 5;
  } else if (mn == 9 || mn == 8) {
    mn_sten = 6;
  } else if (mn == 7) {
    mn_sten = 7;
  } else if (mn == 6 || mn == 5) {
    mn_sten = 8;
  } else if (mn == 4) {
    mn_sten = 9;
  } else {
    mn_sten = 10;
  }
  if (mn_sten >= 9) {
    res_mn_text =
      "ДУЖЕ ВИСОКИЙ рівень соціалізації. Суворо орієнтований на загальноприйняті і соціально схвалювані норми поведінки. Суворо дотримується корпоративних вимог. У повсякденній діяльності групові інтереси ставить вище особистісних. Виражені альтруїстські якості.";
  } else if (mn_sten == 8) {
    res_mn_text =
      "ВИСОКИЙ рівень соціалізації. Суворо орієнтований на загальноприйняті і соціально ухвалені норми поведінки. Схильний дотримуватися корпоративних вимог. У повсякденній діяльності групові інтереси ставить вище особистісних.";
  } else if (mn_sten == 7) {
    res_mn_text =
      "ДОСТАТНЬО ВИСОКИЙ рівень соціалізації. Орієнтований на дотримання загальноприйнятих і соціально ухвалених норм поведінки. Дотримується корпоративних вимог. У повсякденній життєдіяльності групові інтереси, як правило, переважають над особистісними інтересами.";
  } else if (mn_sten == 6) {
    res_mn_text =
      "ДОСТАТНІЙ рівень соціалізації. У цілому орієнтований на дотримання загальноприйнятих і соціально ухвалених норм поведінки. У цілому дотримується корпоративних вимог. В повсякденній життєдіяльності групові інтереси, як правило, переважають над особистісними інтересами.";
  } else if (mn_sten == 5) {
    res_mn_text =
      "В ЦІЛОМУ ДОСТАТНІЙ рівень соціалізації. Прагне дотримуватися загальноприйнятих і соціально ухвалених норм поведінки. У повсякденній життєдіяльності групові інтереси, як правило, переважають над особистісними інтересами.";
  } else if (mn_sten == 4) {
    res_mn_text =
      "ЗАДОВІЛЬНИЙ рівень соціалізації. Не завжди орієнтований на дотримання загальноприйнятих і соціально ухвалених норми поведінки. У повсякденній життєдіяльності особистісні інтереси, як правило, переважають над груповими.";
  } else if (mn_sten == 3) {
    res_mn_text =
      "НЕДОСТАТНІЙ рівень соціалізації. В цілому не прагне дотримуватися загальноприйнятих норм поведінки і соціально ухвалених вимог. В повсякденній життєдіяльності особистісні інтереси переважають над груповими.";
  } else if (mn_sten == 2) {
    res_mn_text =
      "НИЗЬКИЙ рівень соціалізації. Не прагне дотримуватися загальноприйнятих норм поведінки. В основному вважає за краще діяти згідно власних планів, не орієнтуючись на думку оточуючих. В повсякденній життєдіяльності переважають егоцентричні тенденції. Особистісні інтереси переважають над інтересами групи. Досягнення особистісних інтересів може здійснювати в обхід існуючих заборон і правил.";
  } else {
    res_mn_text =
      "ВКРАЙ НИЗЬКИЙ рівень соціалізації (значно відмінний від номінальних значень для даної вікової групи). Вважає за краще діяти згідно власних планів, не рахуючись з думкою оточуючих. Особистісні інтереси домінують над груповими. Для досягнення особистісних інтересів ігноруються загальноприйняті норми і правила поведінки.";
  }
  //------------- Військово-професійна спрямованість (ВПС) --------------//
  let vps_plus = proveResults(keys_vps_true, true);
  let vps_minus = proveResults(keys_vps_false, false);
  let vps = vps_plus + vps_minus;
  let res_vps_text = String();
  let vps_sten =  Number();
  if (vps <= 25 && vps >= 18) {
    vps_sten = 1;
  } else if (vps == 16 || vps == 17) {
    vps_sten = 2;
  } else if (vps == 15 || vps == 14) {
    vps_sten = 3;
  } else if (vps <= 13 && vps >= 11) {
    vps_sten = 4;
  } else if (vps <= 10 && vps >= 8) {
    vps_sten = 5;
  } else if (vps <= 7 && vps >= 5) {
    vps_sten = 6;
  } else if (vps == 4) {
    vps_sten = 7;
  } else if (vps == 3 || vps == 2) {
    vps_sten = 8;
  } else if (vps == 1) {
    vps_sten = 9;
  } else {
    vps_sten = 10;
  }

  if (vps_sten <= 10 && vps_sten >= 8) {
    res_vps_text =
      "ВИСОКИЙ рівень військово-професійної спрямованості. Виражене бажання продовжувати професійну діяльність, у тому числі і в особливих умовах.";
  } else if (vps_sten == 7 || vps == 6) {
    res_vps_text =
      "ДОСТАТНІЙ рівень військово-професійної спрямованості. Стійка орієнтація на продовження професійної діяльності, у тому числі і в особливих умовах.";
  } else if (vps_sten == 5) {
    res_vps_text =
      "В ЦІЛОМУ ДОСТАТНІЙ рівень військово-професійної спрямованості. Орієнтований на продовження професійної діяльності, у тому числі і в особливих умовах.";
  } else if (vps_sten == 4) {
    res_vps_text =
      "НЕДОСТАТНІЙ рівень військово-професійної спрямованості. Не повною мірою задоволений своєю військовою професійною діяльністю і службовим призначенням. Орієнтація на продовження професійної діяльності сумнівна.";
  } else {
    res_vps_text =
      "НИЗЬКИЙ рівень військово-професійної спрямованості. Не задоволений своєю військовою професійною діяльністю і службовим призначенням.";
  }
  //------------- Схильність до девіантних форм поведінки (ДАП) --------------//
  let dap_plus = proveResults(keys_dap_true, true);
  let dap_minus = proveResults(keys_dap_false, false);
  let dap = dap_plus + dap_minus;
  let res_dap_text = String();
  let dap_sten = Number();

  if (dap >= 25) {
    dap_sten = 1;
  } else if (dap <= 24 && dap >= 21) {
    dap_sten = 2;
  } else if (dap <= 20 && dap >= 18) {
    dap_sten = 3;
  } else if (dap <= 17 && dap >= 15) {
    dap_sten = 4;
  } else if (dap <= 14 && dap >= 12) {
    dap_sten = 5;
  } else if (dap == 11 || dap == 10) {
    dap_sten = 6;
  } else if (dap == 9 || dap == 8) {
    dap_sten = 7;
  } else if (dap == 7 || dap == 6) {
    dap_sten = 8;
  } else if (dap == 5 || dap == 4) {
    dap_sten = 9;
  } else {
    dap_sten = 10;
  }

  if (dap_sten <= 10 && dap_sten >= 6) {
    res_dap_text =
      "ВІДСУТНІСТЬ ознак девіантних (аддиктивної і делинквентної) форм поведінки. Відсутність ознак агресивної поведінки відносно оточуючих. Орієнтація на дотримання соціально ухвалених норм поведінки і раціональну побудову міжперсональних взаємостосунків з ровесниками і із старшими за віком.";
  } else if (dap_sten == 5) {
    res_dap_text =
      "В цілому ВИРАЖЕНІ ознаки девіантних (аддиктивної і делинквентної) форм поведінки ВІДСУТНІ. Відмічається наявність окремих ознак нераціональної побудови міжперсональних взаємостосунків з ровесниками і із старшими за віком. Іноді допускає порушення соціально ухвалених норм поведінки.";
  } else if (dap_sten == 4 || dap_sten == 3) {
    res_dap_text =
      "Наявність ДЕЯКИХ ознак девіантних (аддиктивної і делинквентної) форм поведінки. Наявність агресивних реакцій відносно оточуючих. Схильність до нераціональної побудови міжперсональних взаємостосунків з ровесниками і із старшими за віком. Схильний допускати порушення соціально ухвалених норм поведінки.";
  } else {
    res_dap_text =
      "Наявність ВИРАЗНИХ ознак девіантних (аддиктивної і делинквентної) форм поведінки. Наявність виражених агресивних реакцій відносно оточуючих. Як правило, міжперсональні взаємостосунки з ровесниками і із старшими за віком будує нераціонально. Не орієнтований на дотримання соціально ухвалених норм поведінки.";
  }
  // -----------------Cуїцидальний ризик (СР) -----------------------//
  let sr_plus = proveResults(keys_sr_true, true);
  let sr_minus = proveResults(keys_sr_false, false);
  let sr = sr_plus + sr_minus;
  let res_sr_text = String();
  let sr_sten = Number();
  if (sr >= 15) {
    sr_sten = 1;
  } else if (sr <= 14 && sr >= 10) {
    sr_sten = 2;
  } else if (sr <= 9 && sr >= 7) {
    sr_sten = 3;
  } else if (sr == 6 || sr == 5) {
    sr_sten = 4;
  } else if (sr == 4) {
    sr_sten = 5;
  } else if (sr == 3) {
    sr_sten = 6;
  } else if (sr == 2) {
    sr_sten = 7;
  } else if (sr == 1) {
    sr_sten = 8;
  } else {
    sr_sten = 9;
  }

  if (sr_sten <= 10 && sr_sten >= 6) {
    res_sr_text = "ВІДСУТНІСТЬ ознак суїцидального ризику.";
  } else if (sr_sten == 5) {
    res_sr_text =
      "В ЦІЛОМУ виразних ознак суїцидальної схильності НЕ ВИЯВЛЕНО. Наголошується наявність окремих ознак, що свідчать про певні труднощі в міжперсональних взаємостосунках з ровесниками і (або) із старшими по віку.";
  } else if (sr_sten == 4 || sr_sten == 3) {
    res_sr_text =
      "Відзначена наявність ОКРЕМИХ ознак суїцидальної схильності. За наявності затяжної військово-професійної адаптації або труднощів у міжперсональних взаємостосунках з ровесниками і із старшими за віком можуть виникнути думки суїцидальної спрямованості.";
  } else {
    res_sr_text =
      "Відзначена наявність ВИРАЗНИХ ознак суїцидальної схильності. За наявності затяжної військово-професійної адаптації або труднощів в міжперсональних взаємостосунках з ровесниками і із старшими по віку можуть виникнути думки про суїцидальний шантаж або закінчені суїцидальні дії.";
  }
  tableTest();
  surveyContainer.innerHTML = "<h2>Результати опитування (пояснення):</h2>";
  surveyContainer.innerHTML += `<div class="text-res"><b>Достовірність</b><p>Кількість балів: ${dost}. ${res_dost_text}</p></div>`;
  surveyContainer.innerHTML += `<div class="text-res"><b>Особистісно адаптаційний потенціал (ОАП)</b><p>Кількість стенів: ${oap_sten} (${oap} балів). ${res_oap_text}</p></div>`;
  surveyContainer.innerHTML += `<div class="text-res"><b>Поведінкова регуляція (ПР)</b><p>Кількість стенів: ${pr_sten} (${pr} балів). ${res_pr_text}</p></div>`;
  surveyContainer.innerHTML += `<div class="text-res"><b>Комунікативний потенціал (КП)</b><p>Кількість стенів: ${kp_sten} (${kp} балів). ${res_kp_text}</p></div>`;
  surveyContainer.innerHTML += `<div class="text-res"><b>Моральна нормативність (МН)</b><p>Кількість стенів: ${mn_sten} (${mn} балів). ${res_mn_text}</p></div>`;
  surveyContainer.innerHTML += `<div class="text-res"><b>Військово-професійна спрямованість (ВПС)</b><p>Кількість стенів: ${vps_sten} (${vps} балів). ${res_vps_text}</p></div>`;
  surveyContainer.innerHTML += `<div class="text-res"><b>Схильність до девіантних форм поведінки (ДАП)</b><p>Кількість стенів: ${dap_sten} (${dap} балів). ${res_dap_text}</p></div>`;
  surveyContainer.innerHTML += `<div class="text-res"><b>Cуїцидальний ризик (СР)</b><p>Кількість стенів: ${sr_sten} (${sr} балів). ${res_sr_text}</p></div>`;
  let regex_ = /^([^.])+(?=[.,])/;
  document.getElementById("start-position").style.display = 'none';
  document.getElementById("ultimate_result").style.display = 'block';
  let insert_tab_dost_minus = document.getElementById("dost_minus");
  insert_tab_dost_minus.innerHTML = dost;
  let insert_tab_dost_sum = document.getElementById("dost_sum");
  insert_tab_dost_sum.innerHTML = dost;
 
  let dost_ = res_dost_text.match(regex_)[0];
  let short_text_dost = document.getElementById("dost_text");
  short_text_dost.innerHTML = dost_;

  let insert_tab_pr_plus = document.getElementById("pr_plus");
  insert_tab_pr_plus.innerHTML = pr_plus;
  let insert_tab_pr_minus = document.getElementById("pr_minus");
  insert_tab_pr_minus.innerHTML = pr_minus;
  
  let insert_tab_pr_sum = document.getElementById("pr_sum");
  insert_tab_pr_sum.innerHTML = pr;
  let insert_tab_pr_sten = document.getElementById("pr_sten");
  insert_tab_pr_sten.innerHTML = pr_sten;
  let insert_tab_pr_text = document.getElementById("pr_text");
  let pr_ = res_pr_text.match(regex_)[0];
  insert_tab_pr_text.innerHTML = pr_;

  let insert_tab_kp_plus = document.getElementById("kp_plus");
  insert_tab_kp_plus.innerHTML = kp_plus
  let insert_tab_kp_minus = document.getElementById("kp_minus");
  insert_tab_kp_minus.innerHTML = kp_minus;
  
  let insert_tab_kp_sum = document.getElementById("kp_sum");
  insert_tab_kp_sum.innerHTML = kp;
  let insert_tab_kp_sten = document.getElementById("kp_sten");
  insert_tab_kp_sten.innerHTML = kp_sten;
  let insert_tab_kp_text = document.getElementById("kp_text");
  let kp_ = res_kp_text.match(regex_)[0];
  insert_tab_kp_text.innerHTML = kp_;

  let insert_tab_mn_plus = document.getElementById("mn_plus");
  insert_tab_mn_plus.innerHTML = mn_plus;
  let insert_tab_mn_minus = document.getElementById("mn_minus");
  insert_tab_mn_minus.innerHTML = mn_minus;
  
  let insert_tab_mn_sum = document.getElementById("mn_sum");
  insert_tab_mn_sum.innerHTML = mn;
  let insert_tab_mn_sten = document.getElementById("mn_sten");
  insert_tab_mn_sten.innerHTML = mn_sten;
  let insert_tab_mn_text = document.getElementById("mn_text");
  let mn_ = res_mn_text.match(regex_)[0];
  insert_tab_mn_text.innerHTML = mn_;

  let insert_tab_oap_sum = document.getElementById("oap_sum");
  insert_tab_oap_sum.innerHTML = oap;
  let insert_tab_oap_sten = document.getElementById("oap_sten");
  insert_tab_oap_sten.innerHTML = oap_sten;
  let insert_tab_oap_text = document.getElementById("oap_text");
  let oap_ = res_oap_text.match(regex_)[0];
  insert_tab_oap_text.innerHTML = oap_; 
  
  let insert_tab_vps_plus = document.getElementById("vps_plus");
  insert_tab_vps_plus.innerHTML = vps_plus;
  let insert_tab_vps_minus = document.getElementById("vps_minus");
  insert_tab_vps_minus.innerHTML = vps_minus;
  
  let insert_tab_vps_sum = document.getElementById("vps_sum");
  insert_tab_vps_sum.innerHTML = vps;
  let insert_tab_vps_sten = document.getElementById("vps_sten");
  insert_tab_vps_sten.innerHTML = vps_sten;
  let insert_tab_vps_text = document.getElementById("vps_text");
  let vps_ = res_vps_text.match(regex_)[0];
  insert_tab_vps_text.innerHTML = vps_;

  let insert_tab_dap_plus = document.getElementById("dap_plus");
  insert_tab_dap_plus.innerHTML = dap_plus;
  let insert_tab_dap_minus = document.getElementById("dap_minus");
  insert_tab_dap_minus.innerHTML = dap_minus;
  
  let insert_tab_dap_sum = document.getElementById("dap_sum");
  insert_tab_dap_sum.innerHTML = dap;
  let insert_tab_dap_sten = document.getElementById("dap_sten");
  insert_tab_dap_sten.innerHTML = dap_sten;
  let insert_tab_dap_text = document.getElementById("dap_text");
  let dap_ = res_dap_text.match(regex_)[0];
  insert_tab_dap_text.innerHTML = dap_;

  let insert_tab_sr_plus = document.getElementById("sr_plus");
  insert_tab_sr_plus.innerHTML = sr_plus;
  let insert_tab_sr_minus = document.getElementById("sr_minus");
  insert_tab_sr_minus.innerHTML = sr_minus;
  
  let insert_tab_sr_sum = document.getElementById("sr_sum");
  insert_tab_sr_sum.innerHTML = sr;
  let insert_tab_sr_sten = document.getElementById("sr_sten");
  insert_tab_sr_sten.innerHTML = sr_sten;
  let insert_tab_sr_text = document.getElementById("sr_text");
  let sr_ = res_sr_text.match(regex_)[0];
  insert_tab_sr_text.innerHTML = sr_;
}
// Початок опитування
showQuestion(0);
