document.addEventListener("DOMContentLoaded", function () {
    // Масив з 120 значень "+"/"-"
    var valuesArray = ["+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "+", "+", "+",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-",
    "+", "-", "+", "-", "+", "-", "+", "-", "+", "-"
  ];
  
    // Функція для створення таблиці та заповнення її значеннями
    function generateTable(valuesArray, rows, cols) {
      var table = document.createElement("table");
      var counter = 0;
  
      for (var i = 0; i < rows; i++) {
        var row = table.insertRow();
  
        for (var j = 0; j < cols; j++) {
          var cell = row.insertCell();
          cell.textContent = valuesArray[counter];
          counter++;
        }
      }
  
      // Додаємо таблицю до body або іншого контейнера на сторінці
      document.body.appendChild(table);
    }
  
    // Викликаємо функцію з параметрами 12 рядків і 10 стовпців
    generateTable(valuesArray, 12, 10);
  });